Revit 2027 API
Path3d.NumCurveLoops Property
Get the Number of Curve Loops of Path3d.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumCurveLoops { get; }
Public ReadOnly Property NumCurveLoops As Integer
	Get
public:
property int NumCurveLoops {
	int get ();
}
member NumCurveLoops : int with get
Property Value
Int32
Remarks
Returns the Number of Curve Loops of Path3d.
See Also
Reference
Path3d Class
Autodesk.Revit.DB Namespace